{
  "basics": {
    "name": "Alex Milkov",
    "label": "Software Engineer",
    "email": "amilkov3@gmail.com",
    "phone": "+1 (404) 317-1005",
    "summary": "Past experience resides in distributed systems and programming language theory (worked in all language paradigms) but also have expertise in finance (ML for trading, quantitative finance, equity valuation, etc) and ML but no work experience yet. Seeking dev roles preferably around finance, ML, or crypto but this isn't a requirement",
    "location": {
      "city": "East Coast",
      "countryCode": "US"
    }
  },
  "work": [{
    "company": "Square (Block)",
    "position": "Senior Software Engineer",
    "website": "https://block.xyz",
    "startDate": "Jul 2019",
    "highlights": [
      "Inventory team: Backend end services (Go) which manage merchant inventory (counts, costs, etc) and provide reporting",
      "Items team: Backend service (Go) which manages merchant catalogs (what they sell). Datastore is sharded MySQL. Search is backed by Elasticsearch. Rearchitected next generation of this service which is a generic object store all teams can use, backed again by MySQL",
      "Introduced Rust to Square by porting internal libraries necessary to run a service in Square's environments. (gRPC + HTTP server framework, clients, custom protobuf compiler, admin console, MySQL + Redis integration, logging, metrics, Envoy, builds, feeds, jobs, etc)",
      "Lots of design docs, PR reviews, interviews, and documentation writing"
    ]
  },
  {
    "company": "Comcast",
    "position": "Senior Software Engineer (Contract)",
    "website": "https://weather.com",
    "startDate": "Jun 2018",
    "endDate": "Dec 2018",
    "highlights": [
      "Full stack work on isomorphic system - Scala.js + React bindings, Scala backend (heavy functional programming shop) - enabling operators to remotely manage the configuration of hundreds of thousands of newly rolled out networking devices"
    ]
  },
  {
    "company": "The Weather Company (IBM)",
    "position": "Senior Software Engineer",
    "website": "https://weather.com",
    "startDate": "Sep 2016",
    "endDate": "Jun 2019",
    "highlights": [
      "Migrated services to EKS (AWS's managed Kubernetes) and carved out best practices and recommended tooling (Prometheus, Alertmanager, Grafana, Loki, nginx-ingress, etc) as part of org-wide migration to IBM Cloud",
      "Responsible for developing and maintaining user profile system (Scala) that manages all user data such as subscriptions, locations, demographics, and device endpoints",
      "Responsible for developing and maintaining alerting system (Scala), which fetches user subscriptions, populates content templates, and distributes them to devices",
      "Lead initiatives to adopt libraries and develop tooling in the purely functional side of the Scala ecosystem. Mentored engineers in functional programming language theory"
    ]
  }
  ],
  "education": [
    {
      "institution": "Georgia Institute of Technology",
      "area": "Computer Science",
      "studyType": "M.S.",
      "startDate": "Jan 2015",
      "endDate": "Dec 2018"
    },
    {
      "institution": "Georgia Institute of Technology",
      "area": "Industrial Engineering",
      "studyType": "B.S.",
      "startDate": "Aug 2011",
      "endDate": "Dec 2014"
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "keywords": [
        "Go",
        "Rust",
        "Python",
        "Scala",
        "Haskell",
        "Clojure",
        "Java",
        "JavaScript/Typescript"
      ]
    },
    {
      "name": "Datastores",
      "keywords": [
        "MySQL",
        "MongoDB",
        "Elasticsearch",
        "ArangoDB"
      ]
    },
    {
      "name": "Devops",
      "keywords": [
        "Terraform",
        "Kubernetes",
        "Docker"
      ]
    }
  ],
  "languages": [{
    "language": "Bulgarian",
    "fluency": "Native speaker"
  }]
}
